<template>
<div>
  <canvas id="canvas"></canvas>
</div>
</template>

<script>
export default {
  mounted() {
    var canvas = new this.$fabric.Canvas("canvas", {
      width: window.innerWidth,
      height: 400
    });
    var path = new this.$fabric.Path('M 0 0 L 200 100 L 170 200 z');
    // 我们通过传递一串路径指令，实例化fabric.Path对象，
    // 虽然看起来很神秘，但实际上很容易理解。
    // “M”代表“move”命令，并告诉笔移动到0，0坐标。
    // “L”表示“line”，笔画线为200，100坐标。
    // 然后，另一个“L”创建一个连接170，200坐标的线段。
    // 最后，“z”指示绘画笔关闭当前路径并完成形状。结果，我们得到一个三角形。
    path.set({
      left: 120,
      top: 120
    });
    path.set({
      fill: 'red',
      stroke: 'green',
      opacity: .5
    })

    var path2 = new this.$fabric.Path("M121.32,0L44.58,0C36.67,0,29.5,3.22,24.31,8.41\
c-5.19,5.19-8.41,12.37-8.41,20.28c0,15.82,12.87,28.69,28.69,28.69c0,0,4.4,\
0,7.48,0C36.66,72.78,8.4,101.04,8.4,101.04C2.98,106.45,0,113.66,0,121.32\
c0,7.66,2.98,14.87,8.4,20.29l0,0c5.42,5.42,12.62,8.4,20.28,8.4c7.66,0,14.87\
-2.98,20.29-8.4c0,0,28.26-28.25,43.66-43.66c0,3.08,0,7.48,0,7.48c0,15.82,\
12.87,28.69,28.69,28.69c7.66,0,14.87-2.99,20.29-8.4c5.42-5.42,8.4-12.62,8.4\
-20.28l0-76.74c0-7.66-2.98-14.87-8.4-20.29C136.19,2.98,128.98,0,121.32,0z");

    canvas.add(path2.set({
      left: 100,
      top: 200
    }));
    canvas.add(path)
  },
}
</script>
